'use strict';

const {
	section, h1, h2, h3, hr, header, i, ul, li,
	table, thead, tbody, tr, td, th
} = require('../util/vdom');

module.exports = ({state, actions}) => section('#ui', [
	header([
		section('.title', [
			h1('Родолюбец'),
			h2('Културно-просветно дружество за връзки с бесарабските и таврийските българи')
		]),
		ul('#menu', [
			li('Начало'),
			li('Новини'),
			li('За Нас'),
			li('Алманах'),
			li('Информация'),
			li('Изследвания'),
			li('Връзки')
		])
	]),
	section('#content', [
		section('.article', [
			h2('Петър Германов'),
			h3('Първият и пожизнен председател на „Родолюбец“'),
			section('.body', {props: {innerHTML: `
				<p><a href="http://rod.i4web.biz/wp-content/uploads/2013/10/Petar_Germanov.jpg"><img class="size-medium wp-image-69 alignright" style="border: 1px solid #333333; margin-left: 10px;" title="Petar_Germanov" src="http://rod.i4web.biz/wp-content/uploads/2013/10/Petar_Germanov-e1380812499690.jpg" alt="" height="291" width="201"></a>Петър Германов е първият и пожизненият председател на „Родолюбец”, дружеството за приятелство и културни връзки с бесарабските, таврийските и кримските българи. Роден е на 19.03 1923 г. в семейството на бежанци от Лозенградско.</p>
				<p>След началното образование в родното село Яворово, Провадийско, учи и завършва Варненската гимназия, а след нея и Военно училище. След 9 септември 1944 година участва в Нишката и Косовската военна операция. След войната следва славянска филология в Софийския университет, работи като преподавател, преводач, служител в Комитета за културни връзки с чужбина и Славянския комитет (по-късно Комитет за българите в чужбина), откъдето е изпращан в българските културни центрове в Берлин и Виена. Тук той има възможности да събира сведения за българските диаспори извън България и да установява контакти с учени, писатели, творчески дейци, общественици и др.</p>
				<p>Точно Петър Германов запознава брат си, големият поет Андрей Германов със съдбата и живота на бесарабските и таврическите българи. Андрей Германов е човекът, който творчески подпомага, подава ръка на Петър Бурлак-Вълканов да твори на роден български език. Братята открехват и широко отварят прозорец към тези български диаспори. Петър Германов успява да посети много селища с българско население в бившия Съветски съюз. Изпраща и сам носи вестници, списания, книги, грамофонни плочи с българска народна музика.</p>
				<p>Съвсем закономерно, когато вятърът на промените полъхна над България, Петър Германов е сред инициаторите за създаване на дружество за приятелство и културни връзки с българите от някогашна Бесарабия и Таврия. Инициативната група от журналисти, писатели, дейци на културата, общественици учредява и регистрира дружество „Родолюбец” на 26.04.1990 г. Петър Германов е избран за председател на дружеството и продължава да проправя мостове между Тараклия, Болград, Таврическите села и България. След 19.03.2002 година за председател на „Родолюбец” е избран поетът и преводачът Александър Миланов. Единодушно Петър Германов е удостоен с пожизнено почетно председателство.</p>
				<p>Жизненият път на Петър Германов завърши на 14 юни 2011 г, за да продължи във вечността.</p>
			`}})
		]),
		section('.right-column', [
			section('.calendar', [
				table([
					thead([
						tr([
							th('<'),
							th({attrs: {colspan: 5}}, 'Октомври 2016'),
							th('>')
						]),
						tr(['Пон', 'Вто', 'Сря', 'Чет', 'Пет', 'Съб', 'Нед'].map(wday =>
							th(wday)
						))
					]),
					tbody([
						tr([1, 2, 3, 4, 5, 6, 7].map(day => td(day))),
						tr([1, 2, 3, 4, 5, 6, 7].map(day => td(day))),
						tr([1, 2, 3, 4, 5, 6, 7].map(day => td(day))),
						tr([1, 2, 3, 4, 5, 6, 7].map(day => td(day)))
					])
				])
			]),
			section([
				h3('Предстоящи събития:'),
				ul([
					li('17.04 Среща със Сергей Пачев'),
					li('17.04 Среща със Сергей Пачев'),
					li('17.04 Среща със Сергей Пачев'),
					li('17.04 Среща със Сергей Пачев')
				])
			])
		])
	])

]);
