'use strict';

const {
	section, h1, h2, h3, hr, header, i, ul, li, p,
	table, thead, tbody, tr, td, th
} = require('../../util/vdom');

const rightColumn = require('../right-column');

module.exports = ({state, actions}) => section('#content', [
	section('.articles', [
		section('.article', [
			h1('Алманах "Родолюбец"'),
			p('Като печатно издание на дружество “Родолюбец” всяка четна година излиза алманахът “Родолюбец”, една истинска “христоматия по родолюбие”. '),
			p('Като сборник от полезни, тематични четива, Алманахът има утвърдени 8 дяла, които се поддържат във всеки брой, както следва:'),
			ul([
				li('Дял I. ДЕ Е БЪЛГАРИЯ? - географски очерци за България или за нейни области и очерци за обекти в тях.'),
				li('Дял II. БЪЛГАРИЯ ПРЕЗ ВЕКОВЕТЕ - Исторически очерци за България.'),
				li('Дял III. ЮБИЛЕЙНИ ГОДИШНИНИ - Отразяват се значителни събития от българската история, явяващи се юбилейни към годината на издаването на Алманаха.'),
				li('Дял IV. БЪЛГАРСКИ ПАНТЕОН - Раздел, в който са отбелязани значими личности от българската политическа и културна история.'),
				li('Дял V. СЪКРОВИЩНИЦА НА НАРОДНИЯ ДУХ - Статии и очерци върху българския фолклор и образци от народни песни и приказки.'),
				li('Дял VI. С БЪЛГАРИЯ В СЪРЦЕТО - Най-важният и най-обемист дял от сборника, изпълнен с изповеди, спомени, статии и очерци на бесарабски и за бесарабски българи, очерци за българите-гагаузи в Бесарабия и в България и за българите живеещи вън от границите на България.'),
				li('Дял VII. ТВОРЦИ ОТ БЕСАРАБИЯ - кратки биографични бележки и творби на бесарабски поети и творци'),
				li('Дял VIII. РОДОЛЮБЕЦ ЗА СЕБЕ СИ - раздел, в който дружеството отразява някои от своите дейности, публикува нормативни документи, свързани с обучението на студентите от българската диаспора извън границите на днешна България, специалисти и обнародва списъци на приети у нас студенти, на завършилите в България специалисти и на изпратените в Бесарабия учители.')
			])
		])]
	),
	rightColumn({state, actions})
]);
